module.exports = {

    '-1': '内部服务器错误',
    '-2': '后台服务接口请求发生错误',
    '-3': '微信接口通信过程发生错误',
    '-4': '非法访问',
    '-5': '微信模块暂时无法使用',
    '-6': '公众号授权过期，请重新授权',
    '-7': '审核状态不允许编辑信息',

    '-10000': "请不要再登录后执行注册操作",
    '-10001': "提交内容无效或存在无法转换的格式",
    '-10002': "电话号码格式不匹配",
    '-10003': "密码为空或太短",
    '-10004': "密码和重复密码不匹配",
    '-10086': "授权成功！创建商户成功",
    '-10010': '授权成功！创建商户失败',




    // ====================================================

    1: "系统发生错误",

    10001: "登录参数填写不完整",
    10002: "账号或密码错误",
    10003: "该账号未注册",
    10004: "在登录状态下进行注册，此操作为非法操作",
    10005: "账号重复注册",
    10006: "登录信息无效或过期，请重新登录",

    11000: "商家参数错误",
    11001: "不存在商家信息",
    11002: "新增营销入口为空",

    81001: "移动端接口参数错误",
    81006: "会员端未登录",
    81009: "越权操作：没有找到对应的会员与商户的关联"
};